[
  {
    "title": "Hidden Figures",
    "productionCountries": ["USA"],
    "productionYear": 2017,
    "length": "2 tim 7 min",
    "genre": ["Biografi", "Drama", "Historia"],
    "distributor": "20th Century Fox",
    "language": "Engelska",
    "subtitles": "Svenska",
    "director": "Theodore Melfi",
    "actors": ["Taraji P. Henson", "Octavia Spencer", "Janelle Monáe"],
    "description": "<p>Dolda tillgångar är en amerikansk biografisk dramafilm från 2016, regisserad av Theodore Melfi och skriven av Melfi och Allison Schroeder. Den är baserad på boken Dolda tillgångar av Margot Lee Shetterly och är en autentisk historia. Filmen handlar om tre kvinnliga afroamerikanska matematiker som arbetade på NASA under början av 1960-talet.</p>",
    "images": "hidden-figures-poster1.jpg",
    "youtubeTrailers": "https://www.youtube.com/watch?v=5wfrDhgUMGI",
    "reviews": [
      {
        "source": "We got this covered",
        "quote": "While Hidden Figures hits many of the beats one would expect, Melfi’s film strikes a delicate balance of injecting levity within the character-based historical drama that propels the story forward. ",
        "stars": 80,
        "max": 100
      },
      {
        "source": "TheWrap",
        "quote": "Hidden Figures is feel-good history, but it works, and it works on behalf of heroes from a cinematically under-served community. These smart accomplished women had the right stuff, and so does this movie. ",
        "stars": 75,
        "max": 100
      },
      {
        "source": "The Playlist",
        "quote": "A paean to the unsung, Hidden Figures is also a romanticized tribute to everyday problem solvers who, in the movie’s eyes, are their own kind of superheroes.",
        "stars": 75,
        "max": 100
      }
    ]
  },
  {
    "title": "Pulp Fiction",
    "productionCountries": ["USA"],
    "productionYear": 1994,
    "length": "2 tim 34 min",
    "genre": ["Brott", "Drama"],
    "distributor": "Miramax Films",
    "language": "Engelska",
    "subtitles": "Svenska",
    "director": "Quentin Tarantino",
    "actors": ["John Travolta", "Uma Thurman", "Samuel L. Jackson"],
    "description": "Två maffiamördares, en boxares, en gangsterfrus och ett par restaurangrånares liv sammanflätas i fyra berättelser om våld och försoning.",
    "images": "https://upload.wikimedia.org/wikipedia/en/3/3b/Pulp_Fiction_(1994)_poster.jpg",
    "youtubeTrailers": "https://www.youtube.com/watch?v=s7EdQ4FqbhY",
    "reviews": [
      {
        "source": "Variety",
        "quote": "A spectacularly entertaining piece of pop culture, Pulp Fiction is the \"American Graffiti\" of violent crime pictures.",
        "stars": 78,
        "max": 100
      },
      {
        "source": "Rolling Stone",
        "quote": "The new King Kong of crime movies...Ferocious fun without a trace of caution, complacency or political correctness to inhibit its 154 deliciously lurid minutes.",
        "stars": 100,
        "max": 100
      },
      {
        "source": "The Washington Post",
        "quote": "The experience overall is like laughing down a gun barrel, a little bit tiring, a lot sick and maybe far too perverse for less jaded moviegoers. ",
        "stars": 70,
        "max": 100
      }
    ]
  },
  {
    "title": "The Toxic Avenger",
    "productionCountries": ["USA"],
    "productionYear": 1984,
    "length": "1 tim 22 min",
    "genre": ["Action", "Komedi", "Skräck"],
    "distributor": "Troma Entertainment",
    "language": "Engelska",
    "subtitles": "Svenska",
    "director": "Michael Herz, Lloyd Kaufman",
    "actors": ["Mitch Cohen", "Andree Maranda", "Jennifer Babtist"],
    "description": "<Melvin Junko är en liten och klent byggd man som arbetar som vaktmästare på ett av de lokala gymmen i Tromaville, New Jersey. Han blir konstant mobbad av ett gäng som hänger på gymmet och blir en dag kastad ner i en tunna med Kärnkraftsavfall. Detta gör att Melvin muterar och blir den enorma besten Toxic Avenger. Med stor styrka och ett ohyggligt utseende, bekämpar Toxic Avenger brott och räddar folket i Tromaville",
    "images": "the-toxic-tvenger-poster1.jpg",

    "youtubeTrailers": "https://www.youtube.com/watch?v=sKeONEIskWI&ab_channel=AGFA",
    "reviews": [
      {
        "source": "The Austin Chronicle",
        "quote": "This is the main movie that built the house of Troma, Lloyd Kaufman's production company devoted to low-budget camp. The Toxic Avenger tells the humorous story of a geeky weakling who is turned into a superhero when he is slimed by some toxic waste.",
        "stars": 78,
        "max": 100
      },
      {
        "source": "Variety",
        "quote": "This madcap spoof on The Incredible Hulk is an outlandish mix of gory violence and realistic special effects.",
        "stars": 70,
        "max": 100
      },
      {
        "source": "Reader",
        "quote": "Cruddy, primal, extremely violent, and fairly entertaining, this 1984 feature from the New York-based exploitation outfit Troma, Inc. (Lloyd Kaufman and Michael Herz) captures some of the snot-flicking spirit of the old EC comics. How much you'll enjoy its deliberate crudity probably depends on how far you can let yourself regress to surly adolescence.",
        "stars": 63,
        "max": 100
      }
    ]
  },
  [
    {
      "title": "Tenet",
      "productionCountries": ["USA", "England"],
      "productionYear": 2020,
      "length": "2 tim 30 min",
      "genre": "Action",
      "distributor": "Warner Bros. Pictures",
      "language": "Engelska",
      "subtitles": "Svenska",
      "director": "Christopher Nolan",
      "actors": [
        "John David Washington",
        "Robert Pattinson",
        "Elizabeth Debicki"
      ],
      "description": "I en skuggvärld av spionage på hög internationell nivå är ordet Tenet det enda redskap han har för att rädda mänskligheten. Hans mål utvecklas under det att uppdraget utförs. Bortom tiden. Inte tidsresor. Inversion.",
      "images": "img/tenet.jpg",
      "youtubeTrailers": "https://www.youtube.com/watch?v=AZGcmvrTX9M",
      "reviews": [
        {
          "source": "Ljud & Bild",
          "quote": "Nolans kaotiska lek med tid och rum.",
          "stars": 5,
          "max": 6
        },
        {
          "source": "Filmtopp",
          "quote": "Kungen av 'brainy blockbusters' är tillbaka.",
          "stars": 4,
          "max": 5
        },
        {
          "source": "Cinetaste",
          "quote": "Christopher Nolan tar actiongenren till nya nivåer",
          "stars": 4,
          "max": 5
        }
      ]
    }
  ]
]
